{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "GPTNeoForCausalLM",
    "parent_library": "transformers.models.gpt_neo.modeling_gpt_neo"
  },
  "base_model_name_or_path": "EleutherAI/gpt-neo-125M",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "attn.attention.q_proj",
    "attn.attention.out_proj",
    "attn.attention.v_proj",
    "attn.attention.k_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}